#pragma once
#include "Player.h"
#include "PointGuard.h"
#include "PowerForward.h"
#include "ShootingGuard.h"
#include "SmallForward.h"

class teamManegment
{
public:
    teamManegment();
    teamManegment(Player *arr[]);
    ~teamManegment();
    void printArr();
    void printOpen5();
    void printTeamStats();
    void printTeamPoints();
    void setOpenFive();
    void setNewPlayer(Player *Nplayer);
    void changeOpenFive(int in, int out);
    int size;
    int amount;
    Player **arr;
    Player *Open5[5];

private:
    int Tshoot;
    int Tfouls;
    int Tblocks;
    int Tassists;

    void updateFoul(int s_num);
    void updateAssist(int s_num);
    void updateShoot(int s_num, ShootType, bool s_success);
    void updateBlock(int s_num);
};

/*מחלקתTeamMagangement:
מחלקה זו תשתמש במערך דינאמי של מצביעים לשחקנים.
מחלקה זו תנהל את השחקנים ותוכל לבצע פעולות שונות:
1.(מערך מוכן של שחקנים) עדכון מערך השחקנים - עם קבלת מידע חדש
○יש למחוק את כל המידע הקודם בצורה מסודרת ולעדכן את השדות
אין להסתמך על מידע חיצוני ויש ליצור את) החדשים בהתאם.
(האובייקטים ולהעתיקם לתוך המחלקה
2.הוספת שחקן חדש - קבלת שחקן ויצירה של האובייקט הרלוונטי בהתאם
לטיפוס זמן הריצה שהתקבל.
3.הדפסת מערך השחקנים - המתודה תדפיס את כל השחקנים במערך, שימו לב
שהמערךהינומסוגPlayer*ונרצהלהדפיסאתהשדותשלכלשחקןקונקרטי
הנמצאבמערךלמשל)עבורShootingGuardנרצהלהדפיסמידעעלאחוזי
.(הקליעה
4.עדכון פרטי שחקן מסויים:
יש לייצר מתודות על מנת לתפעל את השחקנים:
○ביצוע עבירה - לאחר עדכון עבירה של שחקן יש לבדוק האם השחקן
עומדבמכסהשל5עבירותבמידהוהואהגיעל-5עבירותישלהדפיס
הודעה.
○מסירת אסיסט
○(והסוג שלה + הצלחה או לא) סריקה לסל
○חסימות
○כל אחת מהמתודות תקבל מס' גופיה של שחקן ואת הפרמטרים
הדרושים ותבצע את העדכון.
5.הדפסת סטטיסטיקה קבוצתית:
○המתודה תסכום את נתוני השחקנים ותדפיס למסך את המצב הקבוצתי.
6.הדפסת כמות הנקודות הקבוצתית:
○המתודה תסכום את הנקודות שקלעו כל שחקני הקבוצה ותדפיס את
התוצאה למסך.
7.בחירת חמישיה פותחת:
○המחלקהתחזיקמערךקבועבגודל5שיחזיקמצביעלשחקניםשכרגע
משחקיםבכדורסל)ישלקבוצה5שחקניםעל(המגרש
○המתודה תדפיס למסך את רשימת השחקנים - שם + מספר גופיה
תקלוט חמישה מספרים מהמשתמש בהתאם למספרי הגופיות ותעדכן
את המצביעים במערך החמישיה הפותחת להצביע לאובייקטי השחקנים.
8.החלפת שחקן בחמישיה:
○המתודה תקבל מספר גופיה של שחקן שנמצא בחמישיה ומספר גופיה
, המתודה תחליף בין(שלא בחמישיה - יש לודא זאת) של שחקן בקבוצה
השחקנים.
בסיום יש לשחרר את הזיכרון ממערך השחקנים - נא לודאשכל חלקיהאובייטק
משוחררים ואין זליגות זיכרון. */